In [1]:
import pandas as pd
import numpy as np

In [2]:
train=pd.read_csv('train.csv')
data_test=pd.read_csv('data_test.csv')
label_test=pd.read_csv('label_test.csv')

In [3]:
len(train)

891

In [4]:
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
data_test.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [6]:
label_test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

------------------------------------------------------------------------------------------------------------------------------

# 特徵列解釋
PassengerId:旅客編號

pclass	船票等級 (1 = 1st, 2 = 2nd, 3 = 3rd)

sex:性別

Age:年齡

sibsp	船上的兄弟姐妹/配偶數

parch	船上的父母/子女總數

ticket	船票編號

fare	票價

cabin	艙號

embarked	登船港口 (C = Cherbourg, Q = Queenstown, S = Southampton)

survival:是否生存	0 = No, 1 = Yes

------------------------------------------------------------------------------------------------------------------------------

# 缺失值處理

In [7]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
data_test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [9]:
train = train[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked','Survived']]
data_test = data_test[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']]

In [10]:
train.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    male  22.0      1      0   7.2500        S         0
1       1  female  38.0      1      0  71.2833        C         1
2       3  female  26.0      0      0   7.9250        S         1
3       1  female  35.0      1      0  53.1000        S         1
4       3    male  35.0      0      0   8.0500        S         0

In [11]:
data_test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

# ============================================================

# 填補空缺值方法
1.平均數

2.眾數

3.補0

4.刪除(列、行)

5.建模回歸

In [12]:
train.isna().sum()

Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
Survived      0
dtype: int64

In [13]:
data_test.isna().sum()

Pclass       0
Sex          0
Age         86
SibSp        0
Parch        0
Fare         1
Embarked     0
dtype: int64

In [14]:
age_mean=np.mean(train['Age'])

In [15]:
age_mean

29.69911764705882

In [16]:
train['Age']=train['Age'].fillna(age_mean)
data_test['Age']=data_test['Age'].fillna(age_mean)

In [17]:
train.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    2
Survived    0
dtype: int64

In [18]:
data_test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        1
Embarked    0
dtype: int64

In [19]:
train=train.dropna()

In [20]:
len(train)

889

In [21]:
fare_mean=np.mean(train['Fare'])

In [22]:
data_test['Fare']=data_test['Fare'].fillna(fare_mean)

In [23]:
train.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [24]:
data_test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

# ============================================================

# 特徵轉換

In [25]:
train['Sex']=train['Sex'].replace('female', 0)
train['Sex']=train['Sex'].replace('male', 1)

In [26]:
train.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Survived
0       3    1  22.0      1      0   7.2500        S         0
1       1    0  38.0      1      0  71.2833        C         1
2       3    0  26.0      0      0   7.9250        S         1
3       1    0  35.0      1      0  53.1000        S         1
4       3    1  35.0      0      0   8.0500        S         0

In [27]:
data_test['Sex']=data_test['Sex'].replace('female', 0)
data_test['Sex']=data_test['Sex'].replace('male', 1)

In [28]:
data_test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0       3    1  34.5      0      0   7.8292        Q
1       3    0  47.0      1      0   7.0000        S
2       2    1  62.0      0      0   9.6875        Q
3       3    1  27.0      0      0   8.6625        S
4       3    0  22.0      1      1  12.2875        S

In [27]:
#embarked 登船港口 (C = Cherbourg, Q = Queenstown, S = Southampton)
train['Embarked']=train['Embarked'].replace('C', 0)
train['Embarked']=train['Embarked'].replace('Q', 1)
train['Embarked']=train['Embarked'].replace('S', 2)

data_test['Embarked']=data_test['Embarked'].replace('C', 0)
data_test['Embarked']=data_test['Embarked'].replace('Q', 1)
data_test['Embarked']=data_test['Embarked'].replace('S', 2)

In [28]:
train

     Pclass  Sex        Age  SibSp  Parch     Fare  Embarked  Survived
0         3    1  22.000000      1      0   7.2500         2         0
1         1    0  38.000000      1      0  71.2833         0         1
2         3    0  26.000000      0      0   7.9250         2         1
3         1    0  35.000000      1      0  53.1000         2         1
4         3    1  35.000000      0      0   8.0500         2         0
..      ...  ...        ...    ...    ...      ...       ...       ...
886       2    1  27.000000      0      0  13.0000         2         0
887       1    0  19.000000      0      0  30.0000         2         1
888       3    0  29.699118      1      2  23.4500         2         0
889       1    1  26.000000      0      0  30.0000         0         1
890       3    1  32.000000      0      0   7.7500         1         0

[889 rows x 8 columns]

# ============================================================

# 數據生成

In [38]:
data_train=train[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']].values
label_train=train[['Survived']].values 

data_test=data_test[['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked']].values
label_test=label_test[['Survived']].values

c:\users\kaineng\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Using a non-tuple sequence for multidimensional indexing is deprecated; use `arr[tuple(seq)]` instead of `arr[seq]`. In the future this will be interpreted as an array index, `arr[np.array(seq)]`, which will result either in an error or a different result.
  after removing the cwd from sys.path.

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [35]:
label_train[0]

array([0], dtype=int64)

In [36]:
label_train=label_train[:,0]
label_test=label_test[:,0]

In [37]:
print(data_train.shape)
print(label_train.shape)
print(data_test.shape)
print(label_test.shape)

(889, 7)
(889,)
(418, 7)
(418,)

# ============================================================

# 標準化

In [36]:
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
ss.fit(data_train) #以 data_train 當作標準化基準
data_train=ss.transform(data_train) #對data_train進行標準化
data_test=ss.transform(data_test) #對data_train進行標準化

In [37]:
print(data_train[0])

[ 0.82520863  0.73534203 -0.59049493  0.43135024 -0.47432585 -0.50023975
  0.58683958]

# ============================================================

# 模型建立-RandomForest

In [43]:
from sklearn.ensemble import RandomForestClassifier
RF_model = RandomForestClassifier(max_depth=5)
RF_model.fit(data_train, label_train) #模型訓練

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [44]:
predict_train_label=RF_model.predict(data_train)

In [45]:
from sklearn.metrics import accuracy_score
print(accuracy_score(label_train,predict_train_label))

0.8526434195725534

In [46]:
predict_test_label=RF_model.predict(data_test)
print(accuracy_score(label_test,predict_test_label))

0.9401913875598086

# ============================================================

# 混淆矩陣

In [47]:
pd.crosstab(label_train,predict_train_label, rownames=["lable"],colnames=["predict"])

predict    0    1
lable
0        513   36
1         95  245

In [48]:
pd.crosstab(label_test,predict_test_label, rownames=["lable"],colnames=["predict"])

predict    0    1
lable
0        257    9
1         16  136